cases/OpenFOAM/incompressible/pimpleFoam/RAS/rotatingFanInRoom/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AMI.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

door.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

fan.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

outlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

room.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

desk.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}


// ************************************************************************* //
